In [13]:
import pandas as pd
import numpy as np
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [14]:
df.shape

(6, 4)

In [15]:
df[0:1]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain

In [16]:
df[1:1]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [17]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [18]:
df[:]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [19]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [20]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [21]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [22]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [23]:
type(df['event'])

pandas.core.series.Series

In [24]:
df[['event','windspeed']] # 2 columns in a dataframe

   event  windspeed
0   Rain          6
1  Sunny          7
2   Snow          2
3   Snow          7
4   Rain          4
5  Sunny          2

# Max temperature

In [25]:
df['temperature'].max()

35

In [26]:
df['temperature'].min()

24

In [27]:
df['temperature'].mean()

30.333333333333332

In [28]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

# Conditional formatting

In [29]:
df[df['temperature']==32]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [30]:
df[df['temperature']>32]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [31]:
df[df['temperature']<32]

        day  temperature  windspeed  event
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
5  1/6/2017           31          2  Sunny

In [32]:
df[df['temperature']==df['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [33]:
df[['day','temperature']][df['temperature']==df['temperature'].max()]

        day  temperature
1  1/2/2017           35

In [34]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [35]:
df.set_index('day',inplace=True)
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [36]:
data=pd.DataFrame(df)
data

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [39]:
data.loc['1/2/2017']

temperature       35
windspeed          7
event          Sunny
Name: 1/2/2017, dtype: object

In [41]:
data[2:3]

          temperature  windspeed event
day
1/3/2017           28          2  Snow

In [42]:
data[2:4]

          temperature  windspeed event
day
1/3/2017           28          2  Snow
1/4/2017           24          7  Snow

In [45]:
data.iloc[2:4]

          temperature  windspeed event
day
1/3/2017           28          2  Snow
1/4/2017           24          7  Snow

In [49]:
data.iloc[0::2,0::2] # it gives only the odd columns with odd row values

          temperature event
day
1/1/2017           32  Rain
1/3/2017           28  Snow
1/5/2017           32  Rain

In [71]:
data.reset_index(inplace=True)
data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [72]:
data.set_index('event',inplace=True)
data

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [75]:
data.loc['Rain'] # acts as hash-key

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Rain   1/5/2017           32          4

In [80]:
data.dtypes # types of objects in a dataframe

day            object
temperature     int64
windspeed       int64
dtype: object

In [82]:
data

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

# 
iloc[:, ::2]: The iloc method is used to select rows and columns by index position.
: means select all rows.
::2 means select every second column starting from index 0 (the first column)

In [83]:
data.iloc[:,::2]

            day  windspeed
event
Rain   1/1/2017          6
Sunny  1/2/2017          7
Snow   1/3/2017          2
Snow   1/4/2017          7
Rain   1/5/2017          4
Sunny  1/6/2017          2

In [87]:
data.iloc[:,1::2] # : all rows, 1::2 means 1 is the 2nd column (0 means 1st column) and step up every 2nd one

       temperature
event
Rain            32
Sunny           35
Snow            28
Snow            24
Rain            32
Sunny           31

In [105]:
new_list=['ram','sam']
new_list

['ram', 'sam']

In [117]:
for loop in range(len(new_list)):
    for names in new_list:
        names=names[i-1]+names[i-2]+names[i-3]
        l.append(names)
    print(names);

mas
mas

In [165]:
l=[]
for names in new_list:
    rev=names[::-1]
    l.append(rev)
print(l)

['mar', 'mas']

In [164]:
for names in new_list:
    rev=names[::-1] # using in-built slicing function [::-1], start,stop,step
    print(rev)

mar
mas

In [163]:
rev_names = [] # initialized empty list 
for name in new_list: # iterating each string within the array
    i=len(name) - 1 # i,variable = (length of string array -1)= to get the last index value 
    rev_name = "" # initialized empty string
    while i>=0:  # while loop with i
        rev_name += name[i] # saving each char of the string
        i -= 1 # as it is in reverse mode starting with last index value i.e. 2,1,0
    rev_names.append(rev_name)# append the strings in the list
print(rev_names) # print list

['mar', 'mas']